#int float bool str

# name = 'Nuri' #str
# age = 21 #int
# have_ielts = True #bool
# bank_account = 20003.324 # float
# background = "Was born in aktobe asdfasdfadsfadsf"
#
# print(567)
# print(name)
# print(type(bank_account))
# print(bank_account)
# print(have_ielts)
# print(123)
# print(background)
# print(type(background))


""""""""""""""""""""""""""""""""""""""""""""""""""""""

# complex

# number1 = 3 + 4j
# number2 = complex(2, 5)
#
# print(number1)
# print(number2)
# print(type(number1))
#
# print(number1.real)   # действительная часть
# print(number1.imag)   # мнимая часть


""""""""""""""""""""""""""""""""""""""""""""""""""""""


# decimal
# 📌 Что это?
#
# Тип для точных финансовых вычислений.
#
# ⚠ Почему не float?
# Потому что float может давать ошибки округления.
# from decimal import Decimal
#
# price1 = Decimal("10.10")
# price2 = Decimal("0.10")
# age = 19
# year = "1999"
# price = '2000.2312'
# ff = 2000.2312
#
# total = price1 + price2
#
# print(total)
# print(type(total))
# print(age)
# print(type(age))
# print(type(year))
# print(type(ff))


""""""""""""""""""""""""""""""""""""""""""""""""""""""

# 🔹 3️⃣ NoneType
# 📌 Что это?
#
# None — это отсутствие значения.
#
# Тип:
#
# <class 'NoneType'>
# 💻 Пример
# NoneType

# value = None
# year = " "
#
# print(value)
# print(type(value))
# print(year)
# print(type(year))

# def say_hello(a, b):
#     print("Hello")
#     return a
#
# x = 1
# y = 2
# result = say_hello(a=x, b=y)
# #result = 3
#
# print(result)
# # print(type(result))

""""""""""""""""""""""""""""""""""""""""""""""""""""""

# 🔹 4️⃣ dict
# 📌 Что это?
#
# Словарь — хранит данные в формате:
#
# ключ : значение
# 💻 Пример
# # dict

# user = {
#     "name": "Nuri",
#     "age": 21,
#     "city": "Aktobe"
# }
#
# print(user)
# print(type(user))
#
# print(user["name"])
# print(user["age"])

""""""""""""""""""""""""""""""""""""""""""""""""""""""
#
# 🔹 5️⃣ defaultdict
# 📌 Что это?
#
# Это словарь, который автоматически создаёт значение по умолчанию.
#
# Импортируется из:
#
# from collections import defaultdict
# 💻 Обычный dict (ошибка)
# normal_dict = {}
#
# # normal_dict["count"] += 1  # будет ошибка!
# 💻 defaultdict
# # defaultdict
#
# from collections import defaultdict
#
# user = {}
# # user["count"] += 1
# # print(user)
# # print(type(user))
#
# dd = defaultdict(int)
# dd["count"] += 1
# dd["count"] += 1
# print(dd)
# print(type(dd))
# 📌 Почему это удобно?
#
# Не нужно проверять:
#
# if key not in dict:
#     dict[key] = 0
# 📌 Где используется?
#
# подсчёт слов
#
# группировка данных
#
# статистика
#
# обработка логов
#
# 🔥 Частый вопрос на собесе
#
# В чём разница между dict и defaultdict?
#
# Ответ:
#
# dict → кидает ошибку если ключа нет
#
# defaultdict → создаёт значение автоматически
#
# 🎯 Хочешь закрепить?
#
# Могу дать:
#
# 3 практические задачи
#
# мини-тест как на интервью
#
# tricky вопросы по типам данных
#
# Скажи — усложняем или пока базу закрепляем?

""""""""""""""""""""""""""""""""""""""""""""""""""""""
#
# 🔹 1️⃣ list
# 📌 Что это?
#
# Список — изменяемая коллекция.
#
# можно менять
#
# можно добавлять
#
# можно удалять
#
# сохраняет порядок
#
# допускает дубликаты
#
# 💻 Пример
# # list
# 0      1   2   3   4
# [15, 234, 34, 423, 534]
# numbers = [15, 234, 34, 423, 534]
#
# print(numbers)
# print(type(numbers))
#
# numbers.append(6)   # добавление
# print(numbers)
#
# print(numbers[0])
# print(len(numbers))
#
# numbers[0] = 100    # изменение
# print(numbers)
#
# print(len(numbers))
# 📌 Где используется?
#
# хранение данных
#
# результаты запросов из БД
#
# JSON массивы
#
# перебор через for
#
# Это самая используемая коллекция в Python.

""""""""""""""""""""""""""""""""""""""""""""""""""""""



""""""""""""""""""""""""""""""""""""""""""""""""""""""



""""""""""""""""""""""""""""""""""""""""""""""""""""""



""""""""""""""""""""""""""""""""""""""""""""""""""""""



""""""""""""""""""""""""""""""""""""""""""""""""""""""
